In [1]:
import pandas as pd
import numpy as np
# List of Tuples
empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]


# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])


print("Contents of the Dataframe : ")
print(df)


# Delete columns containing either 75% or more than 75% NaN Values
perc = 75.0
min_count =  int(((100-perc)/100)*df.shape[0] + 1)
mod_df = df.dropna( axis=1, thresh=min_count)
print("Modified Dataframe : ")
print([mod_df])

Contents of the Dataframe :
      A     B   C       D     E   F   G     H    I
0  Jack   NaN  34  Sydney   NaN   5 NaN   NaN  NaN
1  Riti  23.0  31     NaN   NaN   7 NaN   NaN  NaN
2   NaN   NaN  16  London  32.0  11 NaN   3.0  NaN
3  Mark   NaN  41   Delhi   NaN  12 NaN  11.0  1.0
Modified Dataframe :
[      A   C       D   F     H
0  Jack  34  Sydney   5   NaN
1  Riti  31     NaN   7   NaN
2   NaN  16  London  11   3.0
3  Mark  41   Delhi  12  11.0]

In [2]:
empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]



# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])
print("Contents of the Dataframe : ")
print(df)

Contents of the Dataframe :
      A     B   C       D     E   F   G     H    I
0  Jack   NaN  34  Sydney   NaN   5 NaN   NaN  NaN
1  Riti  23.0  31     NaN   NaN   7 NaN   NaN  NaN
2   NaN   NaN  16  London  32.0  11 NaN   3.0  NaN
3  Mark   NaN  41   Delhi   NaN  12 NaN  11.0  1.0

In [3]:
# numeric columns
>>> df.fillna(df.select_dtypes(include='number').mean().iloc[0], inplace=True)

# categorical columns
>>> df.fillna(df.select_dtypes(include='object').mode().iloc[0], inplace=True)

C:\Users\sony\anaconda3\lib\site-packages\pandas\core\algorithms.py:969: UserWarning: Unable to sort modes: '<' not supported between instances of 'numpy.ndarray' and 'str'
  warn(f"Unable to sort modes: {err}")

In [4]:
# Delete columns containing either 95% or more than 95% NaN Values
perc = 95.0
min_count =  int(((100-perc)/100)*df.shape[0] + 1)
mod_df = df.dropna( axis=1, thresh=min_count)
print("Modified Dataframe : ")
print([mod_df])

Modified Dataframe :
[      A     B   C       D     E   F     G     H     I
0  Jack  23.0  34  Sydney  23.0   5  23.0  23.0  23.0
1  Riti  23.0  31    23.0  23.0   7  23.0  23.0  23.0
2  23.0  23.0  16  London  32.0  11  23.0   3.0  23.0
3  Mark  23.0  41   Delhi  23.0  12  23.0  11.0   1.0]

DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)

In [5]:
df.fillna(df.mean()).fillna(df.mode().iloc[0])

C:\Users\sony\AppData\Local\Temp/ipykernel_732/779930004.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.fillna(df.mean()).fillna(df.mode().iloc[0])
C:\Users\sony\anaconda3\lib\site-packages\pandas\core\algorithms.py:969: UserWarning: Unable to sort modes: '<' not supported between instances of 'numpy.ndarray' and 'str'
  warn(f"Unable to sort modes: {err}")

      A     B   C       D     E   F     G     H     I
0  Jack  23.0  34  Sydney  23.0   5  23.0  23.0  23.0
1  Riti  23.0  31    23.0  23.0   7  23.0  23.0  23.0
2  23.0  23.0  16  London  32.0  11  23.0   3.0  23.0
3  Mark  23.0  41   Delhi  23.0  12  23.0  11.0   1.0

df['DataFrame Column'] = df['DataFrame Column'].fillna(0)

df.fillna(int(0, inplace=True))

In [6]:
mod_df

      A     B   C       D     E   F     G     H     I
0  Jack  23.0  34  Sydney  23.0   5  23.0  23.0  23.0
1  Riti  23.0  31    23.0  23.0   7  23.0  23.0  23.0
2  23.0  23.0  16  London  32.0  11  23.0   3.0  23.0
3  Mark  23.0  41   Delhi  23.0  12  23.0  11.0   1.0

In [7]:
my_data = mod_df.replace(mod_df, is.numeric, ~replace(., is.na(.), 0))
#my_data = mod_df.replace((np.NaN,0), value=0,inplace=True,limit=None,regex=False)

SyntaxError: invalid syntax (Temp/ipykernel_732/2570753218.py, line 1)

In [8]:

# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Student Name': [ np.nan, 'Shivansh', 'Ishdeep',  
                         'Siddharth', np.nan, 'Prakhar',
                         'Yash', 'Srikar', 'Kaustubh', 
                         'Aditya',  'Manav', np.nan],
        'Roll No.': [ 18229, 18232, np.nan, 18247, 18136, 
                     np.nan, 18283, 18310, 18102, 18012,
                     18121, 18168],
        'Subject ID': [204, np.nan, 201, 105, np.nan, 204,
                       101, 101, np.nan, 165, 715, np.nan],
       'Grade Point': [9, np.nan, 7, np.nan, 8, 7, 9, 10,
                       np.nan, 9, 6, 8]}

In [9]:
# Create the dataframe
df = pd.DataFrame(nums)
  
df

   Student Name  Roll No.  Subject ID  Grade Point
0           NaN   18229.0       204.0          9.0
1      Shivansh   18232.0         NaN          NaN
2       Ishdeep       NaN       201.0          7.0
3     Siddharth   18247.0       105.0          NaN
4           NaN   18136.0         NaN          8.0
5       Prakhar       NaN       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         NaN          NaN
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11          NaN   18168.0         NaN          8.0

In [10]:
df.dtypes

Student Name     object
Roll No.        float64
Subject ID      float64
Grade Point     float64
dtype: object

In [11]:
type(df.columns)

pandas.core.indexes.base.Index

In [12]:
df[['Roll No.', 'Subject ID', 'Grade Point']] = df[['Roll No.', 'Subject ID', 'Grade Point']].replace(np.nan, 0)
df

   Student Name  Roll No.  Subject ID  Grade Point
0           NaN   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4           NaN   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11          NaN   18168.0         0.0          8.0

In [13]:
df.replace(np.nan, -999999)

   Student Name  Roll No.  Subject ID  Grade Point
0       -999999   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4       -999999   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11      -999999   18168.0         0.0          8.0

In [14]:
# Apply the function
df = df.replace(np.nan, 0)
  
# print the DataFrame
df

   Student Name  Roll No.  Subject ID  Grade Point
0             0   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4             0   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11            0   18168.0         0.0          8.0

In [15]:
df.fillna(0, inplace=True)

In [16]:
df

   Student Name  Roll No.  Subject ID  Grade Point
0             0   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4             0   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11            0   18168.0         0.0          8.0

In [17]:
c = df.select_dtypes(np.number).columns

df[c] = df[c].fillna(0)

In [18]:
df

   Student Name  Roll No.  Subject ID  Grade Point
0             0   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4             0   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11            0   18168.0         0.0          8.0

In [19]:
df= pd.DataFrame(data={'col1': [np.nan,'b','c','d'],
                       'col2': [1,2,np.nan,4],
                       'col3': [np.nan,'b','c','d'],
                       'col4': [1,2,np.nan,4]})

print (df)

  col1  col2 col3  col4
0  NaN   1.0  NaN   1.0
1    b   2.0    b   2.0
2    c   NaN    c   NaN
3    d   4.0    d   4.0

In [20]:
c = df.select_dtypes(np.number).columns

df[c] = df[c].fillna(0)

In [21]:
df

  col1  col2 col3  col4
0  NaN   1.0  NaN   1.0
1    b   2.0    b   2.0
2    c   0.0    c   0.0
3    d   4.0    d   4.0

In [22]:
empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]



# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])
print("Contents of the Dataframe : ")
print(df)

Contents of the Dataframe :
      A     B   C       D     E   F   G     H    I
0  Jack   NaN  34  Sydney   NaN   5 NaN   NaN  NaN
1  Riti  23.0  31     NaN   NaN   7 NaN   NaN  NaN
2   NaN   NaN  16  London  32.0  11 NaN   3.0  NaN
3  Mark   NaN  41   Delhi   NaN  12 NaN  11.0  1.0

In [23]:
def rmissingvaluecol(dff, threshold):
    l = []
    l = list(dff.drop(dff.loc[:,list((100*(dff.isnull().sum()/len(dff.index)) >= threshold))].columns, 1).columns.values)
    print("# Columns having more than %s percent missing values: "%threshold, (dff.shape[1] - len(l)))
    print("Columns:\n", list(set(list((dff.columns.values))) - set(l)))
    return l

In [ ]:
# Delete columns containing either 95% or more than 95% NaN Values
perc = 95.0
min_count =  int(((100-perc)/100)*df.shape[0] + 1)
df = df.dropna( axis=1, thresh=min_count,inplace=True)
print("Modified Dataframe : ")
print(df)

In [ ]:
df

In [ ]:
df.dtypes

In [ ]:
df.columns

df.dtype='category'

In [ ]:
df

In [ ]:
c = df.select_dtypes('float64',"int64").columns

df[c]=df[c].replace(np.nan,0)


#df[[ 'B', 'C', 'E', 'F', 'H', 'I']] = df[['B', 'C', 'E', 'F', 'H', 'I']].replace(np.nan, 0)
df

In [ ]:
df.dtypes

In [ ]:
c = df.select_dtypes('object').columns

df[c]=df[c].replace(np.NaN,-99999)

In [ ]:
df.info()

In [ ]:
df

In [ ]:
def missingvaluecol(df, threshold):
    perc = 95.0
    min_count =  int(((100-perc)/100)*df.shape[0] + 1)
    df = df.dropna( axis=1, thresh=min_count)
    print("Modified Dataframe : ")
    print([df])

In [ ]:
missingvaluecol(df, 0.95)

In [ ]:
df

In [ ]:
empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]



# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])
print("Contents of the Dataframe : ")
print(df)

In [ ]:
df.info()

In [ ]:
#class data:

def missingvaluecol(df, threshold):
    perc = 95.0
    min_count =  int(((100-perc)/100)*df.shape[1]+1 )
    df = df.dropna( axis=1, thresh=min_count,inplace=True)

    #print("Modified Dataframe : ")
    print(df)
    
def replace_numeric(df,value): 
    c = df.select_dtypes("float64","int64").columns
    df[c]=df[c].replace(np.nan,value)
    print(df)
    
def replace_catagory(df,value):     
    c = df.select_dtypes('object').columns
    df[c]=df[c].replace(np.NaN,value)

In [ ]:
class data :
    
    
    #def my_function(df,value):
    
    def missingvaluecol(df, threshold):                                 #if  perc <= 95.0:
        perc = 95.0
        min_count =  int(((100-perc)/100)*df.shape[1]+1 )
        df = df.dropna( axis=1, thresh=min_count,inplace=True)
        return df

    def replace_numeric(df,value): 
        #if type == int and float64 :
        #else:
            df.c = df.select_dtypes("float64","int64").columns
            df.df[c]=df[c].replace(np.nan,0)
            print(df)
    
    def replace_catagory(df,value):     
        #if type == object:
            df.c = df.select_dtypes('object').columns
            df.df[c]=df[c].replace(np.NaN,value)
            print(df)

In [ ]:
df=data

In [ ]:
missingvaluecol(df,95)

In [ ]:
df

In [ ]:
def tri_recursion(k):
    if(k > 0):
        result = k + tri_recursion(k - 1)
        print(result)
    else:
        result = 0
    return result

print("\n\nRecursion Example Results")
tri_recursion(6)

In [ ]:
#def my_function():
      #print("Hello from a function")

In [ ]:
my_function(df)

In [ ]:
df

In [ ]:
my_function(df,95.0)

In [ ]:
replace_numeric(df,0)

In [ ]:
df

In [ ]:
missingvaluecol(df,95)

In [ ]:
df

In [ ]:
replace_numeric(df,0)

In [ ]:
df

In [ ]:
replace_catagory(df,-99999)

In [ ]:
df

In [ ]:
df

In [ ]:
df.info()

In [ ]:
 perc = 95.0
    min_count =  int(((100-perc)/100)*df.shape[0] + 1)
    df = df.dropna( axis=1, thresh=min_count)

In [ ]:
Size = 4122
Shape=(458, 9)
Shape[0] x Shape[1] = 4122
ndim of dataframe = 2
ndim of series=1

In [ ]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                  "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis='columns')

In [ ]:
df.dropna(how='all')

In [ ]:
df.dropna(thresh=3)

In [ ]:
df.dropna(inplace=True)

In [ ]:
df

In [ ]:
empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]



# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])
print("Contents of the Dataframe : ")
print(df)

In [ ]:
for col in df.columns: 
    if sum(df[col].isnull())/float(len(df.index)) > 0.8: 
        del df[col]

In [ ]:
df = df.loc[:, df.isnull().mean() < .8]

In [ ]:
for col in df.columns: 
    if sum(df[col].isnull()>0.95): 
        del df[col]

In [ ]:
df

In [ ]:
df

In [ ]:
df.dropna(axis=1, thresh = int(0.8*df.shape[]), inplace=True)

In [ ]:
df.shape[1]

In [ ]:
import pandas as pd
import numpy as np

empoyees = [('Jack', np.NaN, 34, 'Sydney', np.NaN,  5,  np.NaN, np.NaN, np.NaN),
            ('Riti', 23    , 31, np.NaN , np.NaN,  7,  np.NaN, np.NaN, np.NaN),
            (np.NaN, np.NaN, 16, 'London', 32,      11, np.NaN, 3, np.NaN),
            ('Mark', np.NaN, 41, 'Delhi' , np.NaN,  12, np.NaN, 11, 1)]



# Create a DataFrame object
df = pd.DataFrame(  empoyees,
                    columns=['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'])

In [ ]:
categorical_variables= (df.select_dtypes('object') ) # categorical variables

categ_var_list=(list(categorical_variables))
print(categ_var_list)

condition_pivot_list_names=[]
pivot_values_list=[]
for i in categ_var_list:
    condition_pivot = df.pivot_table(index=i, values='weight', aggfunc=np.mean)
    pivot_names = (condition_pivot.index.values.tolist())
    condition_pivot_list_names.append(pivot_names)
    pivot_values_draft = ((condition_pivot.values.tolist()))
    pivot_values = [i[0] for i in pivot_values_draft]
    pivot_values_list.append(pivot_values)
print(condition_pivot_list_names, 'condition pivot list names')
print(pivot_values_list,'pivot values list')


sublist_names=[(sublists) for sublists in condition_pivot_list_names]
print(sublist_names)


sublist_values=[(sublists1) for sublists1 in pivot_values_list]
print(sublist_values)

def myfunc(x):
if x in sublist_names:
    index=sublist_names.index(x)
    return sublist_values[index]
return x

df['Name'] = df['Name'].apply(lambda x: myfunc(x))

print(df['Name'])

In [ ]:
df.info()

In [ ]:
df.select_dtypes(('int64',"float64"))

In [ ]:
df

In [ ]:
df.index.isnull()

In [ ]:
categorical_variables= (df.select_dtypes('object') ) # categorical variables

categ_var_list=(list(categorical_variables))

In [ ]:
categ_var_list

In [ ]:
condition_pivot_list_names=[]
pivot_values_list=[]
for i in categ_var_list:
    condition_pivot = df.pivot_table(index=i, values='-999999', agg)
    pivot_names = (condition_pivot.index.values.tolist())
    condition_pivot_list_names.append(pivot_names)
    pivot_values_draft = ((condition_pivot.values.tolist()))
    pivot_values = [i[0] for i in pivot_values_draft]
    pivot_values_list.append(pivot_values)

In [42]:
x=2
for i in range(10):
    if i/2==0 :
        x*=i
        print(x)

0

In [52]:
x=0
for i in range(10):
    if i%2==0 :
        x-=i
        print(x)

0
-2
-6
-12
-20

In [50]:
x=10

x+=5

In [44]:
print(x+=5)

SyntaxError: invalid syntax (Temp/ipykernel_14560/3615754344.py, line 1)